[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:53:17
 
             <Nav className="mr-auto">
               {
-                hasRole(currentUser, "ROLE_USER") && (
-                  <NavDropdown title="Todos" id="appnavbar-todos-dropdown" data-testid="appnavbar-todos-dropdown" >
-                    <NavDropdown.Item href="/todos/list">List Todos</NavDropdown.Item>
-                    <NavDropdown.Item href="/todos/create">Create Todo</NavDropdown.Item>
-                  </NavDropdown>
-                )
+                false
               }
             </Nav>
killedBy: AppNavbar tests renders the todos menu correctly
statusReason: Error: Unable to find an element by: [data-testid="appnavbar-todos-dropdown"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"
    >

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:83:23
                   <NavDropdown title="Parks" id="appnavbar-parks-dropdown" data-testid="appnavbar-parks-dropdown" >
                     <NavDropdown.Item href="/parks/list" data-testid="appnavbar-parks-list">List</NavDropdown.Item>
                     {
-                      hasRole(currentUser, "ROLE_ADMIN") && (
-                        <NavDropdown.Item href="/parks/create" data-testid="appnavbar-parks-create">Create</NavDropdown.Item>
-                      )
+                      false
                     }
                   </NavDropdown>
killedBy: AppNavbar tests renders the parks menu correctly for an admin
statusReason: Error: Unable to find an element by: [data-testid="/appnavbar-parks-create/"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"
    >
