[Killed] StringLiteral
main/components/Parks/ParkForm.js:6:66
 import { useForm } from 'react-hook-form'
 import { useNavigate } from 'react-router-dom';
 
-function ParkForm({ initialContents, submitAction, buttonLabel = "Create" }) {
+function ParkForm({ initialContents, submitAction, buttonLabel = "" }) {
 
     const navigate = useNavigate();
killedBy: ParkForm tests renders correctly with no initialContents
statusReason: Error: Unable to find an element with the text: /Create/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div
