[Killed] BlockStatement
main/components/Parks/ParkTable.js:9:47
 const showCell = (cell) => JSON.stringify(cell.row.values);
 
 
-const defaultDeleteCallback = async (cell) => {
-    console.log(`deleteCallback: ${showCell(cell)})`);
-    parkUtils.del(cell.row.values.id);
-}
+const defaultDeleteCallback = async (cell) => {}
 
 export default function ParkTable({
killedBy: ParkTable tests Delete button calls delete callback
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] StringLiteral
main/components/Parks/ParkTable.js:18:20
     parks,
     deleteCallback = defaultDeleteCallback,
     showButtons = true,
-    testIdPrefix = "ParkTable" }) {
+    testIdPrefix = "" }) {
 
     const navigate = useNavigate();
killedBy: ParkTable tests Has the expected column headers, content and buttons
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="ParkTable-cell-row-0-col-id"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] BlockStatement
main/components/Parks/ParkTable.js:22:36
 
     const navigate = useNavigate();
  
-    const editCallback = (cell) => {
-        console.log(`editCallback: ${showCell(cell)})`);
-        navigate(`/parks/edit/${cell.row.values.id}`)
-    }
+    const editCallback = (cell) => {}
 
     const detailsCallback = (cell) => {
killedBy: ParkTable tests Edit button navigates to the edit page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/parks/edit/2"

Number of calls: 0

<html>
  <head />

[Killed] StringLiteral
main/components/Parks/ParkTable.js:24:18
  
     const editCallback = (cell) => {
         console.log(`editCallback: ${showCell(cell)})`);
-        navigate(`/parks/edit/${cell.row.values.id}`)
+        navigate(``)
     }
 
killedBy: ParkTable tests Edit button navigates to the edit page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/parks/edit/2"
Received: ""

Number of calls: 1

<html>

[Killed] BlockStatement
main/components/Parks/ParkTable.js:27:39
         navigate(`/parks/edit/${cell.row.values.id}`)
     }
 
-    const detailsCallback = (cell) => {
-        console.log(`detailsCallback: ${showCell(cell)})`);
-        navigate(`/parks/details/${cell.row.values.id}`)
-    }
+    const detailsCallback = (cell) => {}
 
     const columns = [
killedBy: ParkTable tests Details button navigates to the details page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/parks/details/2"

Number of calls: 0

<html>
  <head />

[Killed] ArrayDeclaration
main/components/Parks/ParkTable.js:32:21
         navigate(`/parks/details/${cell.row.values.id}`)
     }
 
-    const columns = [
-        {
-            Header: 'id',
-            accessor: 'id', // accessor is the "key" in the data
-        },
-        {
-            Header: 'Name',
-            accessor: 'name',
-        },
-        {
-            Header: 'State',
-            accessor: 'state',
-        },
-        {
-            Header: 'Description',
-            accessor: 'description',
-        },
-        {
-            Header: 'Acres',
-            accessor: 'acres',
-        }
-    ];
+    const columns = [];
 
     const buttonColumns = [
killedBy: ParkTable tests Has the expected column headers, content and buttons
statusReason: TestingLibraryElementError: Unable to find an element with the text: id. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] ObjectLiteral
main/components/Parks/ParkTable.js:41:9
             Header: 'Name',
             accessor: 'name',
         },
-        {
-            Header: 'State',
-            accessor: 'state',
-        },
+        {},
         {
             Header: 'Description',
killedBy: ParkTable tests renders without crashing for empty table
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Parks/ParkTable.js:50:21
             accessor: 'description',
         },
         {
-            Header: 'Acres',
+            Header: "",
             accessor: 'acres',
         }
killedBy: ParkTable tests Has the expected column headers, content and buttons
statusReason: TestingLibraryElementError: Unable to find an element with the text: Acres. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >
