[Killed] LogicalOperator
main/components/Nav/AppNavbar.js:68:17
 
             <Nav className="mr-auto">
               {
-                hasRole(currentUser, "ROLE_USER") && (
-                  <NavDropdown title="Schools" id="appnavbar-schools-dropdown" data-testid="appnavbar-schools-dropdown" >
-                    <NavDropdown.Item href="/schools/">List Schools</NavDropdown.Item>
-                    <NavDropdown.Item href="/schools/create">Create Schools</NavDropdown.Item>
-                  </NavDropdown>
-                )
+                hasRole(currentUser, "ROLE_USER") || <NavDropdown title="Schools" id="appnavbar-schools-dropdown" data-testid="appnavbar-schools-dropdown">
+                    <NavDropdown.Item href="/schools/">List Schools</NavDropdown.Item>
+                    <NavDropdown.Item href="/schools/create">Create Schools</NavDropdown.Item>
+                  </NavDropdown>
               }
             </Nav>
killedBy: AppNavbar tests renders the schools menu correctly
statusReason: Error: Unable to find an element by: [data-testid="appnavbar-schools-dropdown"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"
    >

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:68:17
 
             <Nav className="mr-auto">
               {
-                hasRole(currentUser, "ROLE_USER") && (
-                  <NavDropdown title="Schools" id="appnavbar-schools-dropdown" data-testid="appnavbar-schools-dropdown" >
-                    <NavDropdown.Item href="/schools/">List Schools</NavDropdown.Item>
-                    <NavDropdown.Item href="/schools/create">Create Schools</NavDropdown.Item>
-                  </NavDropdown>
-                )
+                false
               }
             </Nav>
killedBy: AppNavbar tests renders the schools menu correctly
statusReason: Error: Unable to find an element by: [data-testid="appnavbar-schools-dropdown"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"
    >
