[Killed] BlockStatement
main/components/Schools/SchoolTable.js:9:47
 const showCell = (cell) => JSON.stringify(cell.row.values);
 
 
-const defaultDeleteCallback = async (cell) => {
-    console.log(`deleteCallback: ${showCell(cell)})`);
-    schoolUtils.del(cell.row.values.id);
-}
+const defaultDeleteCallback = async (cell) => {}
 
 export default function SchoolTable({
killedBy: SchoolTable tests Delete button calls delete callback
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] BlockStatement
main/components/Schools/SchoolTable.js:22:36
 
     const navigate = useNavigate();
  
-    const editCallback = (cell) => {
-        console.log(`editCallback: ${showCell(cell)})`);
-        navigate(`/schools/edit/${cell.row.values.id}`)
-    }
+    const editCallback = (cell) => {}
 
     const detailsCallback = (cell) => {
killedBy: SchoolTable tests Edit button navigates to the edit page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/schools/edit/2"

Number of calls: 0

<html>
  <head />

[Killed] BlockStatement
main/components/Schools/SchoolTable.js:27:39
         navigate(`/schools/edit/${cell.row.values.id}`)
     }
 
-    const detailsCallback = (cell) => {
-        console.log(`detailsCallback: ${showCell(cell)})`);
-        navigate(`/schools/details/${cell.row.values.id}`)
-    }
+    const detailsCallback = (cell) => {}
 
     const columns = [
killedBy: SchoolTable tests Details button navigates to the details page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/schools/details/2"

Number of calls: 0

<html>
  <head />

[Killed] ArrayDeclaration
main/components/Schools/SchoolTable.js:32:21
         navigate(`/schools/details/${cell.row.values.id}`)
     }
 
-    const columns = [
-        {
-            Header: 'id',
-            accessor: 'id', // accessor is the "key" in the data
-        },
-
-        {
-            Header: 'Name',
-            accessor: 'name',
-        },
-        {
-            Header: 'District',
-            accessor: 'district',
-        },
-        {
-            Header: 'Grade Range',
-            accessor: 'grade range',
-        }
-    ];
+    const columns = [];
 
     const buttonColumns = [
killedBy: SchoolTable tests Has the expected column headers, content and buttons
statusReason: TestingLibraryElementError: Unable to find an element with the text: id. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] StringLiteral
main/components/Schools/SchoolTable.js:44:23
         },
         {
             Header: 'District',
-            accessor: 'district',
+            accessor: "",
         },
         {
killedBy: SchoolTable tests Has the expected column headers, content and buttons
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="SchoolTable-cell-row-0-col-district"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] ObjectLiteral
main/components/Schools/SchoolTable.js:46:9
             Header: 'District',
             accessor: 'district',
         },
-        {
-            Header: 'Grade Range',
-            accessor: 'grade range',
-        }
+        {}
     ];
 
killedBy: SchoolTable tests renders without crashing for empty table
statusReason: Error: A column ID (or string accessor) is required!
