[Killed] BlockStatement
main/pages/Parks/ParkCreatePage.js:6:42
 import { useNavigate } from 'react-router-dom'
 import { parkUtils } from 'main/utils/parkUtils';
 
-export default function ParkCreatePage() {
-
-  let navigate = useNavigate(); 
-
-  const onSubmit = async (park) => {
-    const createdPark = parkUtils.add(park);
-    console.log("createdPark: " + JSON.stringify(createdPark));
-    navigate("/parks");
-  }  
-
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>Create New Park</h1>
-        <ParkForm submitAction={onSubmit} />
-      </div>
-    </BasicLayout>
-  )
-}
+export default function ParkCreatePage() {}
 
killedBy: ParkCreatePage tests renders without crashing
statusReason: Error: ParkCreatePage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] BlockStatement
main/pages/Parks/ParkCreatePage.js:10:36
 
   let navigate = useNavigate(); 
 
-  const onSubmit = async (park) => {
-    const createdPark = parkUtils.add(park);
-    console.log("createdPark: " + JSON.stringify(createdPark));
-    navigate("/parks");
-  }  
+  const onSubmit = async (park) => {}  
 
   return (
killedBy: ParkCreatePage tests redirects to /parks on submit
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] StringLiteral
main/pages/Parks/ParkCreatePage.js:13:14
   const onSubmit = async (park) => {
     const createdPark = parkUtils.add(park);
     console.log("createdPark: " + JSON.stringify(createdPark));
-    navigate("/parks");
+    navigate("");
   }  
 
killedBy: ParkCreatePage tests redirects to /parks on submit
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/parks"
Received: ""

Number of calls: 1

<html>
