[Killed] BlockStatement
main/pages/Parks/ParkDetailsPage.js:6:43
 import ParkTable from 'main/components/Parks/ParkTable';
 import { parkUtils } from 'main/utils/parkUtils';
 
-export default function ParkDetailsPage() {
-  let { id } = useParams();
-
-  const response = parkUtils.getById(id);
-
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>Park Details</h1>
-        <ParkTable parks={[response.park]} showButtons={false} />
-      </div>
-    </BasicLayout>
-  )
-}
+export default function ParkDetailsPage() {}
 
killedBy: ParkDetailsPage tests renders without crashing
statusReason: Error: ParkDetailsPage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] BooleanLiteral
main/pages/Parks/ParkDetailsPage.js:15:57
     <BasicLayout>
       <div className="pt-2">
         <h1>Park Details</h1>
-        <ParkTable parks={[response.park]} showButtons={false} />
+        <ParkTable parks={[response.park]} showButtons={true} />
       </div>
     </BasicLayout>
killedBy: ParkDetailsPage tests loads the correct fields, and no buttons
statusReason: TestingLibraryElementError: Found multiple elements with the text: Delete

Here are the matching elements:

<th
  colspan="1"
  data-testid="ParkTable-header-Delete"
  role="columnheader"
