[Killed] BlockStatement
main/pages/Parks/ParkEditPage.js:8:40
 import { useNavigate } from 'react-router-dom'
 
 
-export default function ParkEditPage() {
-    let { id } = useParams();
-
-    let navigate = useNavigate(); 
-
-    const response = parkUtils.getById(id);
-
-    const onSubmit = async (park) => {
-        const updatedPark = parkUtils.update(park);
-        console.log("updatedPark: " + JSON.stringify(updatedPark));
-        navigate("/parks");
-    }  
-
-    return (
-        <BasicLayout>
-            <div className="pt-2">
-                <h1>Edit Park</h1>
-                <ParkForm submitAction={onSubmit} buttonLabel={"Update"} initialContents={response.park}/>
-            </div>
-        </BasicLayout>
-    )
-}
+export default function ParkEditPage() {}
 
killedBy: ParkEditPage tests renders without crashing
statusReason: Error: ParkEditPage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] BlockStatement
main/pages/Parks/ParkEditPage.js:15:38
 
     const response = parkUtils.getById(id);
 
-    const onSubmit = async (park) => {
-        const updatedPark = parkUtils.update(park);
-        console.log("updatedPark: " + JSON.stringify(updatedPark));
-        navigate("/parks");
-    }  
+    const onSubmit = async (park) => {}  
 
     return (
killedBy: ParkEditPage tests redirects to /parks on submit
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] StringLiteral
main/pages/Parks/ParkEditPage.js:25:64
         <BasicLayout>
             <div className="pt-2">
                 <h1>Edit Park</h1>
-                <ParkForm submitAction={onSubmit} buttonLabel={"Update"} initialContents={response.park}/>
+                <ParkForm submitAction={onSubmit} buttonLabel={""} initialContents={response.park}/>
             </div>
         </BasicLayout>
killedBy: ParkEditPage tests redirects to /parks on submit
statusReason: TestingLibraryElementError: Unable to find an element with the text: Update. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
