[Killed] BlockStatement
main/pages/Parks/ParkIndexPage.js:17:44
 
     const showCell = (cell) => JSON.stringify(cell.row.values);
 
-    const deleteCallback = async (cell) => {
-        console.log(`ParkIndexPage deleteCallback: ${showCell(cell)})`);
-        parkUtils.del(cell.row.values.id);
-        navigate("/parks");
-    }
+    const deleteCallback = async (cell) => {}
 
     return (
killedBy: ParkIndexPage tests delete button calls delete and reloads page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] StringLiteral
main/pages/Parks/ParkIndexPage.js:20:18
     const deleteCallback = async (cell) => {
         console.log(`ParkIndexPage deleteCallback: ${showCell(cell)})`);
         parkUtils.del(cell.row.values.id);
-        navigate("/parks");
+        navigate("");
     }
 
killedBy: ParkIndexPage tests delete button calls delete and reloads page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/parks"
Received: ""

Number of calls: 1

<html>

[Killed] StringLiteral
main/pages/Parks/ParkIndexPage.js:26:41
     return (
         <BasicLayout>
             <div className="pt-2">
-                <Button style={{ float: "right" }} as={Link} to="/parks/create">
+                <Button style={{ float: "" }} as={Link} to="/parks/create">
                     Create Park
                 </Button>
killedBy: ParkIndexPage tests renders correct fields
statusReason: Error: expect(element).toHaveAttribute("style", "float: right;") // element.getAttribute("style") === "float: right;"

Expected the element to have attribute:
  style="float: right;"
Received:
  null

[Killed] ObjectLiteral
main/pages/Parks/ParkIndexPage.js:26:32
     return (
         <BasicLayout>
             <div className="pt-2">
-                <Button style={{ float: "right" }} as={Link} to="/parks/create">
+                <Button style={{}} as={Link} to="/parks/create">
                     Create Park
                 </Button>
killedBy: ParkIndexPage tests renders correct fields
statusReason: Error: expect(element).toHaveAttribute("style", "float: right;") // element.getAttribute("style") === "float: right;"

Expected the element to have attribute:
  style="float: right;"
Received:
  null
