[Killed] BlockStatement
main/pages/Schools/SchoolDetailsPage.js:6:45
 import SchoolTable from 'main/components/Schools/SchoolTable';
 import { schoolUtils } from 'main/utils/schoolUtils';
 
-export default function SchoolDetailsPage() {
-  let { id } = useParams();
-
-  const response = schoolUtils.getById(id);
-
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>School Details</h1>
-        <SchoolTable schools={[response.school]} showButtons={false} />
-      </div>
-    </BasicLayout>
-  )
-}
+export default function SchoolDetailsPage() {}
 
killedBy: SchoolDetailsPage tests renders without crashing
statusReason: Error: SchoolDetailsPage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] BooleanLiteral
main/pages/Schools/SchoolDetailsPage.js:15:63
     <BasicLayout>
       <div className="pt-2">
         <h1>School Details</h1>
-        <SchoolTable schools={[response.school]} showButtons={false} />
+        <SchoolTable schools={[response.school]} showButtons={true} />
       </div>
     </BasicLayout>
killedBy: SchoolDetailsPage tests loads the correct fields, and no buttons
statusReason: TestingLibraryElementError: Found multiple elements with the text: Delete

Here are the matching elements:

<th
  colspan="1"
  data-testid="SchoolTable-header-Delete"
  role="columnheader"
