[Killed] BlockStatement
main/pages/Schools/SchoolEditPage.js:9:42
 import { useNavigate } from 'react-router-dom'
 
 
-export default function SchoolEditPage() {
-    let { id } = useParams();
-
-    let navigate = useNavigate(); 
-
-    const response = schoolUtils.getById(id);
-
-    const onSubmit = async (school) => {
-        const updatedSchool = schoolUtils.update(school);
-        console.log("updatedSchool: " + JSON.stringify(updatedSchool));
-        navigate("/schools");
-    }  
-
-    return (
-        <BasicLayout>
-            <div className="pt-2">
-                <h1>Edit School</h1>
-                <SchoolForm submitAction={onSubmit} buttonLabel={"Update"} initialContents={response.school}/>
-            </div>
-        </BasicLayout>
-    )
-}
+export default function SchoolEditPage() {}
 
killedBy: SchoolEditPage tests renders without crashing
statusReason: Error: SchoolEditPage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] BlockStatement
main/pages/Schools/SchoolEditPage.js:16:40
 
     const response = schoolUtils.getById(id);
 
-    const onSubmit = async (school) => {
-        const updatedSchool = schoolUtils.update(school);
-        console.log("updatedSchool: " + JSON.stringify(updatedSchool));
-        navigate("/schools");
-    }  
+    const onSubmit = async (school) => {}  
 
     return (
killedBy: SchoolEditPage tests redirects to /schools on submit
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>
