[Killed] BlockStatement
main/pages/Schools/SchoolIndexPage.js:17:44
 
     const showCell = (cell) => JSON.stringify(cell.row.values);
 
-    const deleteCallback = async (cell) => {
-        console.log(`SchoolIndexPage deleteCallback: ${showCell(cell)})`);
-        schoolUtils.del(cell.row.values.id);
-        navigate("/schools");
-    }
+    const deleteCallback = async (cell) => {}
 
     return (
killedBy: SchoolIndexPage tests delete button calls delete and reloads page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] StringLiteral
main/pages/Schools/SchoolIndexPage.js:18:21
     const showCell = (cell) => JSON.stringify(cell.row.values);
 
     const deleteCallback = async (cell) => {
-        console.log(`SchoolIndexPage deleteCallback: ${showCell(cell)})`);
+        console.log(``);
         schoolUtils.del(cell.row.values.id);
         navigate("/schools");
killedBy: SchoolIndexPage tests delete button calls delete and reloads page
statusReason: Error: expect(received).toMatch(expected)

Expected substring: "SchoolIndexPage deleteCallback: {\"id\":3,\"name\":\"Dos Pueblos High School\",\"district\":\"Santa Barbara Unified School District\",\"grade range\":\"9-12\"}"
Received string:    ""

[Killed] StringLiteral
main/pages/Schools/SchoolIndexPage.js:20:18
     const deleteCallback = async (cell) => {
         console.log(`SchoolIndexPage deleteCallback: ${showCell(cell)})`);
         schoolUtils.del(cell.row.values.id);
-        navigate("/schools");
+        navigate("");
     }
 
killedBy: SchoolIndexPage tests delete button calls delete and reloads page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/schools"
Received: ""

Number of calls: 1

<html>

[Killed] ObjectLiteral
main/pages/Schools/SchoolIndexPage.js:26:32
     return (
         <BasicLayout>
             <div className="pt-2">
-                <Button style={{ float: "right" }} as={Link} to="/schools/create">
+                <Button style={{}} as={Link} to="/schools/create">
                     Create School
                 </Button>
killedBy: SchoolIndexPage tests renders correct fields
statusReason: Error: expect(element).toHaveAttribute("style", "float: right;") // element.getAttribute("style") === "float: right;"

Expected the element to have attribute:
  style="float: right;"
Received:
  null
