[Killed] BlockStatement
src/main/utils/parkUtils.js:2:19
 // get parks from local storage
-const get = () => {
-    const parkValue = localStorage.getItem("parks");
-    if (parkValue === undefined) {
-        const parkCollection = { nextId: 1, parks: [] }
-        return set(parkCollection);
-    }
-    const parkCollection = JSON.parse(parkValue);
-    if (parkCollection === null) {
-        const parkCollection = { nextId: 1, parks: [] }
-        return set(parkCollection);
-    }
-    return parkCollection;
-};
+const get = () => {};
 
 const getById = (id) => {
killedBy: ParkTable tests Delete button calls delete callback
statusReason: TypeError: Cannot read properties of undefined (reading 'parks')

[Killed] StringLiteral
src/main/utils/parkUtils.js:3:44
 // get parks from local storage
 const get = () => {
-    const parkValue = localStorage.getItem("parks");
+    const parkValue = localStorage.getItem("");
     if (parkValue === undefined) {
         const parkCollection = { nextId: 1, parks: [] }
killedBy: parkUtils tests get When parks is undefined in local storage, should set to empty list
statusReason: Error: Unexpected key:

[Killed] BlockStatement
src/main/utils/parkUtils.js:4:34
 // get parks from local storage
 const get = () => {
     const parkValue = localStorage.getItem("parks");
-    if (parkValue === undefined) {
-        const parkCollection = { nextId: 1, parks: [] }
-        return set(parkCollection);
-    }
+    if (parkValue === undefined) {}
     const parkCollection = JSON.parse(parkValue);
     if (parkCollection === null) {
killedBy: parkUtils tests get When parks is undefined in local storage, should set to empty list
statusReason: SyntaxError: Unexpected token u in JSON at position 0

[Killed] EqualityOperator
src/main/utils/parkUtils.js:4:9
 // get parks from local storage
 const get = () => {
     const parkValue = localStorage.getItem("parks");
-    if (parkValue === undefined) {
+    if (parkValue !== undefined) {
         const parkCollection = { nextId: 1, parks: [] }
         return set(parkCollection);
killedBy: parkUtils tests get When parks is undefined in local storage, should set to empty list
statusReason: SyntaxError: Unexpected token u in JSON at position 0

[Killed] BlockStatement
src/main/utils/parkUtils.js:9:34
         return set(parkCollection);
     }
     const parkCollection = JSON.parse(parkValue);
-    if (parkCollection === null) {
-        const parkCollection = { nextId: 1, parks: [] }
-        return set(parkCollection);
-    }
+    if (parkCollection === null) {}
     return parkCollection;
 };
killedBy: ParkTable tests Delete button calls delete callback
statusReason: TypeError: Cannot read properties of null (reading 'parks')

[Killed] ConditionalExpression
src/main/utils/parkUtils.js:9:9
         return set(parkCollection);
     }
     const parkCollection = JSON.parse(parkValue);
-    if (parkCollection === null) {
+    if (false) {
         const parkCollection = { nextId: 1, parks: [] }
         return set(parkCollection);
killedBy: parkUtils tests get When parks is null in local storage, should set to empty list
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"nextId": 1, "parks": []}
Received: null

[Killed] ObjectLiteral
src/main/utils/parkUtils.js:10:32
     }
     const parkCollection = JSON.parse(parkValue);
     if (parkCollection === null) {
-        const parkCollection = { nextId: 1, parks: [] }
+        const parkCollection = {}
         return set(parkCollection);
     }
killedBy: ParkTable tests Delete button calls delete callback
statusReason: TypeError: Cannot read properties of undefined (reading 'findIndex')

[Killed] ArrayDeclaration
src/main/utils/parkUtils.js:10:52
     }
     const parkCollection = JSON.parse(parkValue);
     if (parkCollection === null) {
-        const parkCollection = { nextId: 1, parks: [] }
+        const parkCollection = { nextId: 1, parks: ["Stryker was here"] }
         return set(parkCollection);
     }
killedBy: parkUtils tests get When parks is null in local storage, should set to empty list
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 3

  Object {
    "nextId": 1,
-   "parks": Array [],

[Killed] BlockStatement
src/main/utils/parkUtils.js:16:25
     return parkCollection;
 };
 
-const getById = (id) => {
-    if (id === undefined) {
-        return { "error": "id is a required parameter" };
-    }
-    const parkCollection = get();
-    const parks = parkCollection.parks;
-
-    /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
-    const index = parks.findIndex((r) => r.id == id);
-    if (index === -1) {
-        return { "error": `park with id ${id} not found` };
-    }
-    return { park: parks[index] };
-}
+const getById = (id) => {}
 
 // set parks in local storage
killedBy: parkUtils tests getById Check that getting a park by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"park": {"acres": 147242, "description": "Magnificent sandstone cliffs, narrow canyons, and diverse plant and animal life.", "id": 3, "name": "Zion National Park", "state": "Utah"}}
Received: undefined

[Killed] ConditionalExpression
src/main/utils/parkUtils.js:24:42
     const parks = parkCollection.parks;
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
-    const index = parks.findIndex((r) => r.id == id);
+    const index = parks.findIndex((r) => false);
     if (index === -1) {
         return { "error": `park with id ${id} not found` };
killedBy: parkUtils tests getById Check that getting a park by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 7
+ Received  + 1

  Object {
-   "park": Object {
-     "acres": 147242,

[Killed] ArrowFunction
src/main/utils/parkUtils.js:24:35
     const parks = parkCollection.parks;
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
-    const index = parks.findIndex((r) => r.id == id);
+    const index = parks.findIndex(() => undefined);
     if (index === -1) {
         return { "error": `park with id ${id} not found` };
killedBy: parkUtils tests getById Check that getting a park by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 7
+ Received  + 1

  Object {
-   "park": Object {
-     "acres": 147242,

[Killed] ConditionalExpression
src/main/utils/parkUtils.js:25:9
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
     const index = parks.findIndex((r) => r.id == id);
-    if (index === -1) {
+    if (true) {
         return { "error": `park with id ${id} not found` };
     }
killedBy: parkUtils tests getById Check that getting a park by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 7
+ Received  + 1

  Object {
-   "park": Object {
-     "acres": 147242,

[Killed] BlockStatement
src/main/utils/parkUtils.js:25:23
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
     const index = parks.findIndex((r) => r.id == id);
-    if (index === -1) {
-        return { "error": `park with id ${id} not found` };
-    }
+    if (index === -1) {}
     return { park: parks[index] };
 }
killedBy: parkUtils tests getById Check that getting a non-existing park returns an error
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "error": "park with id 99 not found",
+   "park": undefined,

[Killed] ObjectLiteral
src/main/utils/parkUtils.js:26:16
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
     const index = parks.findIndex((r) => r.id == id);
     if (index === -1) {
-        return { "error": `park with id ${id} not found` };
+        return {};
     }
     return { park: parks[index] };
killedBy: parkUtils tests getById Check that getting a non-existing park returns an error
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Object {
-   "error": "park with id 99 not found",
- }

[Killed] BlockStatement
src/main/utils/parkUtils.js:32:33
 }
 
 // set parks in local storage
-const set = (parkCollection) => {
-    localStorage.setItem("parks", JSON.stringify(parkCollection));
-    return parkCollection;
-};
+const set = (parkCollection) => {};
 
 // add a park to local storage
killedBy: parkUtils tests get When parks is undefined in local storage, should set to empty list
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"nextId": 1, "parks": []}
Received: undefined

[Killed] StringLiteral
src/main/utils/parkUtils.js:33:26
 
 // set parks in local storage
 const set = (parkCollection) => {
-    localStorage.setItem("parks", JSON.stringify(parkCollection));
+    localStorage.setItem("", JSON.stringify(parkCollection));
     return parkCollection;
 };
killedBy: parkUtils tests get When parks is undefined in local storage, should set to empty list
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "parks", "{\"nextId\":1,\"parks\":[]}"
Received: "", "{\"nextId\":1,\"parks\":[]}"

Number of calls: 1

[Killed] BlockStatement
src/main/utils/parkUtils.js:38:23
 };
 
 // add a park to local storage
-const add = (park) => {
-    const parkCollection = get();
-    park = { ...park, id: parkCollection.nextId };
-    parkCollection.nextId++;
-    parkCollection.parks.push(park);
-    set(parkCollection);
-    return park;
-};
+const add = (park) => {};
 
 // update a park in local storage
killedBy: parkUtils tests add Starting from [], check that adding one park works
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"acres": 761747, "description": "Iconic granite cliffs, waterfalls, giant sequoias, and diverse wildlife.", "id": 1, "name": "Yosemite National Park", "state": "California"}
Received: undefined

[Killed] UpdateOperator
src/main/utils/parkUtils.js:41:5
 const add = (park) => {
     const parkCollection = get();
     park = { ...park, id: parkCollection.nextId };
-    parkCollection.nextId++;
+    parkCollection.nextId--;
     parkCollection.parks.push(park);
     set(parkCollection);
killedBy: parkUtils tests add Starting from [], check that adding one park works
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "parks", "{\"nextId\":2,\"parks\":[{\"id\":1,\"name\":\"Yosemite National Park\",\"state\":\"California\",\"acres\":761747,\"description\":\"Iconic granite cliffs, waterfalls, giant sequoias, and diverse wildlife.\"}]}"
Received: "parks", "{\"nextId\":0,\"parks\":[{\"id\":1,\"name\":\"Yosemite National Park\",\"state\":\"Califor

[Killed] BlockStatement
src/main/utils/parkUtils.js:48:26
 };
 
 // update a park in local storage
-const update = (park) => {
-    const parkCollection = get();
-
-    const parks = parkCollection.parks;
-
-    /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
-    const index = parks.findIndex((r) => r.id == park.id);
-    if (index === -1) {
-        return { "error": `park with id ${park.id} not found` };
-    }
-    parks[index] = park;
-    set(parkCollection);
-    return { parkCollection: parkCollection };
-};
+const update = (park) => {};
 
 // delete a park from local storage
killedBy: parkUtils tests update Check that updating an existing park works
statusReason: Error: expect(received).toEqual(expected) // deep equality

Received: undefined

[Killed] ArrowFunction
src/main/utils/parkUtils.js:54:35
     const parks = parkCollection.parks;
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
-    const index = parks.findIndex((r) => r.id == park.id);
+    const index = parks.findIndex(() => undefined);
     if (index === -1) {
         return { "error": `park with id ${park.id} not found` };
killedBy: parkUtils tests update Check that updating an existing park works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 26
+ Received  +  1

  Object {
-   "parkCollection": Object {
-     "nextId": 5,

[Killed] ConditionalExpression
src/main/utils/parkUtils.js:54:42
     const parks = parkCollection.parks;
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
-    const index = parks.findIndex((r) => r.id == park.id);
+    const index = parks.findIndex((r) => true);
     if (index === -1) {
         return { "error": `park with id ${park.id} not found` };
killedBy: parkUtils tests update Check that updating an non-existing park returns an error
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  -  1
+ Received  + 24

  Object {
-   "error": "park with id 99 not found",
+   "parkCollection": Object {

[Killed] EqualityOperator
src/main/utils/parkUtils.js:55:9
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
     const index = parks.findIndex((r) => r.id == park.id);
-    if (index === -1) {
+    if (index !== -1) {
         return { "error": `park with id ${park.id} not found` };
     }
killedBy: parkUtils tests update Check that updating an existing park works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 26
+ Received  +  1

  Object {
-   "parkCollection": Object {
-     "nextId": 5,

[Killed] BlockStatement
src/main/utils/parkUtils.js:55:23
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
     const index = parks.findIndex((r) => r.id == park.id);
-    if (index === -1) {
-        return { "error": `park with id ${park.id} not found` };
-    }
+    if (index === -1) {}
     parks[index] = park;
     set(parkCollection);
killedBy: parkUtils tests update Check that updating an non-existing park returns an error
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  -  1
+ Received  + 26

  Object {
-   "error": "park with id 99 not found",
+   "parkCollection": Object {

[Killed] StringLiteral
src/main/utils/parkUtils.js:56:27
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
     const index = parks.findIndex((r) => r.id == park.id);
     if (index === -1) {
-        return { "error": `park with id ${park.id} not found` };
+        return { "error": `` };
     }
     parks[index] = park;
killedBy: parkUtils tests update Check that updating an non-existing park returns an error
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "error": "park with id 99 not found",
+   "error": "",

[Killed] BlockStatement
src/main/utils/parkUtils.js:64:21
 };
 
 // delete a park from local storage
-const del = (id) => {
-    if (id === undefined) {
-        return { "error": "id is a required parameter" };
-    }
-    const parkCollection = get();
-    const parks = parkCollection.parks;
-
-    /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
-    const index = parks.findIndex((r) => r.id == id);
-    if (index === -1) {
-        return { "error": `park with id ${id} not found` };
-    }
-    parks.splice(index, 1);
-    set(parkCollection);
-    return { parkCollection: parkCollection };
-};
+const del = (id) => {};
 
 const parkUtils = {
killedBy: parkUtils tests del Check that deleting a park by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

Received: undefined

[Killed] ConditionalExpression
src/main/utils/parkUtils.js:72:42
     const parks = parkCollection.parks;
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
-    const index = parks.findIndex((r) => r.id == id);
+    const index = parks.findIndex((r) => true);
     if (index === -1) {
         return { "error": `park with id ${id} not found` };
killedBy: parkUtils tests del Check that deleting a park by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 5
+ Received  + 5

@@ -1,15 +1,15 @@
  Object {
    "parkCollection": Object {

[Killed] EqualityOperator
src/main/utils/parkUtils.js:73:9
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
     const index = parks.findIndex((r) => r.id == id);
-    if (index === -1) {
+    if (index !== -1) {
         return { "error": `park with id ${id} not found` };
     }
killedBy: parkUtils tests del Check that deleting a park by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 19
+ Received  +  1

  Object {
-   "parkCollection": Object {
-     "nextId": 5,
