[Killed] BlockStatement
src/main/utils/schoolUtils.js:2:19
 // get schools from local storage
-const get = () => {
-    const schoolValue = localStorage.getItem("schools");
-    if (schoolValue === undefined) {
-        const schoolCollection = { nextId: 1, schools: [] }
-        return set(schoolCollection);
-    }
-    const schoolCollection = JSON.parse(schoolValue);
-    if (schoolCollection === null) {
-        const schoolCollection = { nextId: 1, schools: [] }
-        return set(schoolCollection);
-    }
-    return schoolCollection;
-};
+const get = () => {};
 
 const getById = (id) => {
killedBy: SchoolTable tests Delete button calls delete callback
statusReason: TypeError: Cannot read properties of undefined (reading 'schools')

[Killed] ConditionalExpression
src/main/utils/schoolUtils.js:4:9
 // get schools from local storage
 const get = () => {
     const schoolValue = localStorage.getItem("schools");
-    if (schoolValue === undefined) {
+    if (false) {
         const schoolCollection = { nextId: 1, schools: [] }
         return set(schoolCollection);
killedBy: schoolUtils tests get When schools is undefined in local storage, should set to empty list
statusReason: SyntaxError: Unexpected token u in JSON at position 0

[Killed] EqualityOperator
src/main/utils/schoolUtils.js:4:9
 // get schools from local storage
 const get = () => {
     const schoolValue = localStorage.getItem("schools");
-    if (schoolValue === undefined) {
+    if (schoolValue !== undefined) {
         const schoolCollection = { nextId: 1, schools: [] }
         return set(schoolCollection);
killedBy: schoolUtils tests get When schools is undefined in local storage, should set to empty list
statusReason: SyntaxError: Unexpected token u in JSON at position 0

[Killed] ObjectLiteral
src/main/utils/schoolUtils.js:5:34
 const get = () => {
     const schoolValue = localStorage.getItem("schools");
     if (schoolValue === undefined) {
-        const schoolCollection = { nextId: 1, schools: [] }
+        const schoolCollection = {}
         return set(schoolCollection);
     }
killedBy: schoolUtils tests get When schools is undefined in local storage, should set to empty list
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 1

- Object {
-   "nextId": 1,
-   "schools": Array [],

[Killed] BlockStatement
src/main/utils/schoolUtils.js:9:36
         return set(schoolCollection);
     }
     const schoolCollection = JSON.parse(schoolValue);
-    if (schoolCollection === null) {
-        const schoolCollection = { nextId: 1, schools: [] }
-        return set(schoolCollection);
-    }
+    if (schoolCollection === null) {}
     return schoolCollection;
 };
killedBy: SchoolTable tests Delete button calls delete callback
statusReason: TypeError: Cannot read properties of null (reading 'schools')

[Killed] EqualityOperator
src/main/utils/schoolUtils.js:9:9
         return set(schoolCollection);
     }
     const schoolCollection = JSON.parse(schoolValue);
-    if (schoolCollection === null) {
+    if (schoolCollection !== null) {
         const schoolCollection = { nextId: 1, schools: [] }
         return set(schoolCollection);
killedBy: schoolUtils tests get When schools is null in local storage, should set to empty list
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"nextId": 1, "schools": []}
Received: null

[Killed] BlockStatement
src/main/utils/schoolUtils.js:16:25
     return schoolCollection;
 };
 
-const getById = (id) => {
-    if (id === undefined) {
-        return { "error": "id is a required parameter" };
-    }
-    const schoolCollection = get();
-    const schools = schoolCollection.schools;
-
-    /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
-    const index = schools.findIndex((r) => r.id == id);
-    if (index === -1) {
-        return { "error": `school with id ${id} not found` };
-    }
-    return { school: schools[index] };
-}
+const getById = (id) => {}
 
 // set schools in local storage
killedBy: schoolUtils tests getById Check that getting a school by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"school": {"district": "Santa Barbara Unified School District", "grade range": "9-12", "id": 3, "name": "Dos Pueblos High School"}}
Received: undefined

[Killed] ConditionalExpression
src/main/utils/schoolUtils.js:24:44
     const schools = schoolCollection.schools;
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
-    const index = schools.findIndex((r) => r.id == id);
+    const index = schools.findIndex((r) => false);
     if (index === -1) {
         return { "error": `school with id ${id} not found` };
killedBy: schoolUtils tests getById Check that getting a school by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 6
+ Received  + 1

  Object {
-   "school": Object {
-     "district": "Santa Barbara Unified School District",

[Killed] EqualityOperator
src/main/utils/schoolUtils.js:24:44
     const schools = schoolCollection.schools;
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
-    const index = schools.findIndex((r) => r.id == id);
+    const index = schools.findIndex((r) => r.id != id);
     if (index === -1) {
         return { "error": `school with id ${id} not found` };
killedBy: schoolUtils tests getById Check that getting a school by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 4

  Object {
    "school": Object {
-     "district": "Santa Barbara Unified School District",

[Killed] UnaryOperator
src/main/utils/schoolUtils.js:25:19
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
     const index = schools.findIndex((r) => r.id == id);
-    if (index === -1) {
+    if (index === +1) {
         return { "error": `school with id ${id} not found` };
     }
killedBy: schoolUtils tests getById Check that getting a school by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 6
+ Received  + 1

  Object {
-   "school": Object {
-     "district": "Santa Barbara Unified School District",

[Killed] EqualityOperator
src/main/utils/schoolUtils.js:25:9
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
     const index = schools.findIndex((r) => r.id == id);
-    if (index === -1) {
+    if (index !== -1) {
         return { "error": `school with id ${id} not found` };
     }
killedBy: schoolUtils tests getById Check that getting a school by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 6
+ Received  + 1

  Object {
-   "school": Object {
-     "district": "Santa Barbara Unified School District",

[Killed] BlockStatement
src/main/utils/schoolUtils.js:32:35
 }
 
 // set schools in local storage
-const set = (schoolCollection) => {
-    localStorage.setItem("schools", JSON.stringify(schoolCollection));
-    return schoolCollection;
-};
+const set = (schoolCollection) => {};
 
 // add a school to local storage
killedBy: schoolUtils tests get When schools is undefined in local storage, should set to empty list
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"nextId": 1, "schools": []}
Received: undefined

[Killed] BlockStatement
src/main/utils/schoolUtils.js:38:25
 };
 
 // add a school to local storage
-const add = (school) => {
-    const schoolCollection = get();
-    school = { ...school, id: schoolCollection.nextId };
-    schoolCollection.nextId++;
-    schoolCollection.schools.push(school);
-    set(schoolCollection);
-    return school;
-};
+const add = (school) => {};
 
 // update a school in local storage
killedBy: schoolUtils tests add Starting from [], check that adding one school works
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"district": "Santa Barbara Unified School District", "grade range": "7-8", "id": 1, "name": "Goleta Valley Junior High School"}
Received: undefined

[Killed] ObjectLiteral
src/main/utils/schoolUtils.js:40:14
 // add a school to local storage
 const add = (school) => {
     const schoolCollection = get();
-    school = { ...school, id: schoolCollection.nextId };
+    school = {};
     schoolCollection.nextId++;
     schoolCollection.schools.push(school);
killedBy: schoolUtils tests add Starting from [], check that adding one school works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 6
+ Received  + 1

- Object {
-   "district": "Santa Barbara Unified School District",
-   "grade range": "7-8",

[Killed] UpdateOperator
src/main/utils/schoolUtils.js:41:5
 const add = (school) => {
     const schoolCollection = get();
     school = { ...school, id: schoolCollection.nextId };
-    schoolCollection.nextId++;
+    schoolCollection.nextId--;
     schoolCollection.schools.push(school);
     set(schoolCollection);
killedBy: schoolUtils tests add Starting from [], check that adding one school works
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "schools", "{\"nextId\":2,\"schools\":[{\"id\":1,\"name\":\"Goleta Valley Junior High School\",\"district\":\"Santa Barbara Unified School District\",\"grade range\":\"7-8\"}]}"
Received: "schools", "{\"nextId\":0,\"schools\":[{\"id\":1,\"name\":\"Goleta Valley Junior High School\",\"district\":\"Santa Barbara Unified School Dis

[Killed] BlockStatement
src/main/utils/schoolUtils.js:48:28
 };
 
 // update a school in local storage
-const update = (school) => {
-    const schoolCollection = get();
-
-    const schools = schoolCollection.schools;
-
-    /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
-    const index = schools.findIndex((r) => r.id == school.id);
-    if (index === -1) {
-        return { "error": `school with id ${school.id} not found` };
-    }
-    schools[index] = school;
-    set(schoolCollection);
-    return { schoolCollection: schoolCollection };
-};
+const update = (school) => {};
 
 // delete a school from local storage
killedBy: schoolUtils tests update Check that updating an existing school works
statusReason: Error: expect(received).toEqual(expected) // deep equality

Received: undefined

[Killed] ArrowFunction
src/main/utils/schoolUtils.js:54:37
     const schools = schoolCollection.schools;
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
-    const index = schools.findIndex((r) => r.id == school.id);
+    const index = schools.findIndex(() => undefined);
     if (index === -1) {
         return { "error": `school with id ${school.id} not found` };
killedBy: schoolUtils tests update Check that updating an existing school works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 23
+ Received  +  1

  Object {
-   "schoolCollection": Object {
-     "nextId": 5,

[Killed] ConditionalExpression
src/main/utils/schoolUtils.js:54:44
     const schools = schoolCollection.schools;
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
-    const index = schools.findIndex((r) => r.id == school.id);
+    const index = schools.findIndex((r) => false);
     if (index === -1) {
         return { "error": `school with id ${school.id} not found` };
killedBy: schoolUtils tests update Check that updating an existing school works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 23
+ Received  +  1

  Object {
-   "schoolCollection": Object {
-     "nextId": 5,

[Killed] ConditionalExpression
src/main/utils/schoolUtils.js:55:9
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
     const index = schools.findIndex((r) => r.id == school.id);
-    if (index === -1) {
+    if (false) {
         return { "error": `school with id ${school.id} not found` };
     }
killedBy: schoolUtils tests update Check that updating an non-existing school returns an error
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  -  1
+ Received  + 23

  Object {
-   "error": "school with id 99 not found",
+   "schoolCollection": Object {

[Killed] EqualityOperator
src/main/utils/schoolUtils.js:55:9
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
     const index = schools.findIndex((r) => r.id == school.id);
-    if (index === -1) {
+    if (index !== -1) {
         return { "error": `school with id ${school.id} not found` };
     }
killedBy: schoolUtils tests update Check that updating an existing school works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 23
+ Received  +  1

  Object {
-   "schoolCollection": Object {
-     "nextId": 5,

[Killed] BlockStatement
src/main/utils/schoolUtils.js:64:21
 };
 
 // delete a school from local storage
-const del = (id) => {
-    if (id === undefined) {
-        return { "error": "id is a required parameter" };
-    }
-    const schoolCollection = get();
-    const schools = schoolCollection.schools;
-
-    /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
-    const index = schools.findIndex((r) => r.id == id);
-    if (index === -1) {
-        return { "error": `school with id ${id} not found` };
-    }
-    schools.splice(index, 1);
-    set(schoolCollection);
-    return { schoolCollection: schoolCollection };
-};
+const del = (id) => {};
 
 const schoolUtils = {
killedBy: schoolUtils tests del Check that deleting a school by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"schoolCollection": {"nextId": 5, "schools": [{"district": "Goleta Union School District", "grade range": "K-6", "id": 2, "name": "Isla Vista Elementary School"}, {"district": "Carpinteria Unified School District", "grade range": "9-12", "id": 4, "name": "Carpinteria High School"}]}}
Received: undefined

[Killed] ArrowFunction
src/main/utils/schoolUtils.js:72:37
     const schools = schoolCollection.schools;
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
-    const index = schools.findIndex((r) => r.id == id);
+    const index = schools.findIndex(() => undefined);
     if (index === -1) {
         return { "error": `school with id ${id} not found` };
killedBy: schoolUtils tests del Check that deleting a school by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 17
+ Received  +  1

  Object {
-   "schoolCollection": Object {
-     "nextId": 5,

[Killed] ConditionalExpression
src/main/utils/schoolUtils.js:72:44
     const schools = schoolCollection.schools;
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
-    const index = schools.findIndex((r) => r.id == id);
+    const index = schools.findIndex((r) => true);
     if (index === -1) {
         return { "error": `school with id ${id} not found` };
killedBy: schoolUtils tests del Check that deleting a school by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 4

@@ -1,14 +1,14 @@
  Object {
    "schoolCollection": Object {

[Killed] ConditionalExpression
src/main/utils/schoolUtils.js:73:9
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
     const index = schools.findIndex((r) => r.id == id);
-    if (index === -1) {
+    if (true) {
         return { "error": `school with id ${id} not found` };
     }
killedBy: schoolUtils tests del Check that deleting a school by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 17
+ Received  +  1

  Object {
-   "schoolCollection": Object {
-     "nextId": 5,

[Killed] ConditionalExpression
src/main/utils/schoolUtils.js:73:9
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
     const index = schools.findIndex((r) => r.id == id);
-    if (index === -1) {
+    if (false) {
         return { "error": `school with id ${id} not found` };
     }
killedBy: schoolUtils tests del Check that deleting a non-existing school returns an error
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  -  1
+ Received  + 17

  Object {
-   "error": "school with id 99 not found",
+   "schoolCollection": Object {

[Killed] ObjectLiteral
src/main/utils/schoolUtils.js:81:21
     return { schoolCollection: schoolCollection };
 };
 
-const schoolUtils = {
-    get,
-    getById,
-    add,
-    update,
-    del
-};
+const schoolUtils = {};
 
 export { schoolUtils };
killedBy: schoolUtils tests get When schools is undefined in local storage, should set to empty list
statusReason: TypeError: _schoolUtils.schoolUtils.get is not a function
