[Killed] LogicalOperator
src/main/utils/currentUser.js:47:7
 
   if (currentUser == null) return false;
 
-  if ("data" in currentUser &&
-    "root" in currentUser.data &&
-    currentUser.data.root != null &&
+  if ("data" in currentUser && "root" in currentUser.data || currentUser.data.root != null &&
     "rolesList" in currentUser.data.root) {
     return currentUser.data.root.rolesList.includes(role);
killedBy: ProfilePage tests renders correctly for regular logged in user
statusReason: TypeError: Cannot read properties of undefined (reading 'root')
